app/Http/Controllers/User/CheckoutController.php

    public function index()
    {
        $data   =  Keranjang::with('detail_barang.barang')->where('id_user', '1')->get();
---
select * from `barang` where `barang`.`id` in (1, 7)
select * from `detail_barang` where `detail_barang`.`id` in (1, 7)
select * from `keranjang` where `id_user` = '1'