app/Http/Controllers/User/DashboardController.php

    public function index(Request $request)
    {
        if($request->get('search')){

            $barang     = Barang::with(['one_detail_barang' => function($query){
                                $query->where('detail_barang.stok', '>', '0');
                            }])->where('nama', 'like', '%'.$request->get('search').'%')->get();

            return view('user.search',[
                'barang'    => $barang,
                'keyword'   => $request->get('search')
            ]);

        }else{

            $barang     = Barang::with(['one_detail_barang' => function($query){
                                        $query->where('detail_barang.stok', '>', '0');
                                    }])->get();

            $kategori   = Kategori::with('barang.one_detail_barang')->limit(3)->get();
---
select * from `barang` where `nama` like '%new balance%'
select * from `barang`
select * from `kategori` limit 3

    public function show($slug)
    {
        $barang         = Barang::with(['many_detail_barang','kategori'])->where('slug', $slug)->first();
        $relate_barang  = Barang::with('one_detail_barang')->where('nama', 'like', '%'.$barang->nama.'%')->get();
        $new_barang     = Barang::with('one_detail_barang')->where('nama', 'like', '%'.$barang->nama.'%')->orderBy('created_at')->limit(3)->get();
---
select * from `barang` where `slug` = 'multicolor-shirt' limit 1
select * from `kategori` where `kategori`.`id` in (1)
select * from `barang` where `nama` like '%Multicolor Tshirt%'
select * from `barang` where `nama` like '%Multicolor Tshirt%' order by `created_at` asc limit 3

    public function edit(Request $request, $id)
    {
        //get price product by size

        $data = Detail_barang::where('size', $id)->where('id_barang', $request->get('id_barang'))->first();
---
select * from `detail_barang` where `size` = 'M' and `id_barang` = '9' limit 1