app/Http/Controllers/User/KeranjangController.php

    public function index()
    {

        //datatable
        if (request()->ajax()) {

            $query =  Keranjang::with('detail_barang.barang')->where('id_user', Auth::user()->id)->get();
---
select * from `barang` where `barang`.`id` in (1)
select * from `detail_barang` where `detail_barang`.`id` in (1)
select * from `keranjang` where `id_user` = 1

    public function store(Request $request)
    {

        $id_detail_barang   = Detail_barang::where('id_barang', $request->id_barang)->where('size', $request->size)->first();

        $cek                = Keranjang::where('id_user', Auth::user()->id)->where('id_detail_barang', $id_detail_barang->id)->first();

        if ($cek) {

            Keranjang::where('id_user', Auth::user()->id)->where('id_detail_barang', $id_detail_barang->id)->update([
                'qty'           => $request->qty + $cek->qty,
            ]);
        } else {

            Keranjang::create([
                'id_user'               => Auth::user()->id,
                'id_detail_barang'      => $id_detail_barang->id,
                'qty'                   => $request->qty,
            ]);
---
select * from `detail_barang` where `id_barang` = '9' and `size` = 'L' limit 1
select * from `keranjang` where `id_user` = 1 and `id_detail_barang` = 9 limit 1
update `keranjang` set `qty` = 3, `keranjang`.`updated_at` = '2022-01-14 07:26:01' where `id_user` = 1 and `id_detail_barang` = 9
insert into `keranjang` (`id_user`, `id_detail_barang`, `qty`, `updated_at`, `created_at`) values (1, 4, '1', '2022-01-14 06:43:37', '2022-01-14 06:43:37')

    public function show($id)
    {
        $data   = Keranjang::with('detail_barang.barang')->where('id_user', Auth::user()->id)->get();
---
select * from `barang` where `barang`.`id` in (9)
select * from `detail_barang` where `detail_barang`.`id` in (9)
select * from `keranjang` where `id_user` = 1

    public function edit(Request $request, $id)
    {
        Keranjang::find($id)->update([
            'qty'           => $request->get('qty'),
        ]);
---
select * from `keranjang` where `keranjang`.`id` = '14' limit 1
update `keranjang` set `qty` = '1', `keranjang`.`updated_at` = '2022-01-14 07:44:00' where `id` = 14

    public function destroy($id)
    {
        Keranjang::find($id)->delete();
---
delete from `keranjang` where `id` = 12
select * from `keranjang` where `keranjang`.`id` = '12' limit 1